Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: الذين يجعلون مع الله إلها آخر فسوف يعلمون
en: Who set some other god along with Allah. But they will come to know.

source: ولقد نعلم أنك يضيق صدرك بما يقولون
en: Well know We that thy bosom is oppressed by what they say,

source: فسبح بحمد ربك وكن من الساجدين
en: But hymn the praise of thy Lord, and be of those who make prostration (unto Him).

source: واعبد ربك حتى يأتيك اليقين
en: And serve thy Lord till the Inevitable cometh unto thee.

source: أتى أمر الله فلا تستعجلوه سبحانه وتعالى عما يشركون
en: The commandment of Allah will come to pass, so seek not ye to hasten it. Glorified and Exalted be He above all that they associate (with Him).

source: ينزل الملائكة بالروح من أمره على من يشاء من عباده أن أنذروا أنه لا إله إلا أنا فاتقون
en: He sendeth down the angels with the Spirit of His command unto whom He will of His bondmen, (saying): Warn mankind that there is no Allah save Me, so keep your duty unto Me.

source: خلق السماوات والأرض بالحق تعالى عما يشركون
en: He hath created the heavens and the earth with truth. High be He Exalted above all that they associate (with Him).

source: خلق الإنسان من نطفة فإذا هو خصيم مبين
en: He hath created man from a drop of fluid, yet behold! he is an open opponent.

source: والأنعام خلقها لكم فيها دفء ومنافع ومنها تأكلون
en: And the cattle hath He created, whence ye have warm clothing and uses, and whereof ye eat;

source: ولكم فيها جمال حين تريحون وحين تسرحون
en: And wherein is beauty for you, when ye bring them home, and when ye take them out to pasture.

source: وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم
en: And they bear your loads for you unto a land ye could not reach save with great trouble to yourselves. Lo! your Lord is Full of Pity, Merciful.

source: والخيل والبغال والحمير لتركبوها وزينة ويخلق ما لا تعلمون
en: And horses and mules and asses (hath He created) that ye may ride them, and for ornament. And He createth that which ye know not.

source: وعلى الله قصد السبيل ومنها جائر ولو شاء لهداكم أجمعين
en: And Allah's is the direction of the way, and some (roads) go not straight. And had He willed He would have led you all aright.

source: هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون
en: He it is Who sendeth down water from the sky, whence ye have drink, and whence are trees on which ye send your beasts to pasture.

source: ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات إن في ذلك لآية لقوم يتفكرون
en: Therewith He causeth crops to grow for you, and the olive and the date-palm and grapes and all kinds of fruit. Lo! herein is indeed a portent for people who reflect.

source: وسخر لكم الليل والنهار والشمس والقمر والنجوم مسخرات بأمره إن في ذلك لآيات لقوم يعقلون
en: And He hath constrained the night and the day and the sun and the moon to be of service unto you, and the stars are made subservient by His command. Lo! herein indeed are portents for people who have sense.

source: وما ذرأ لكم في الأرض مختلفا ألوانه إن في ذلك لآية لقوم يذكرون
en: And whatsoever He hath created for you in the earth of divers hues, lo! therein is indeed a portent for people who take heed.

source: وهو الذي سخر البحر لتأكلوا منه لحما طريا وتستخرجوا منه حلية تلبسونها وترى الفلك مواخر فيه ولتبتغوا من فضله ولعلكم تشكرون
en: And He it is Who hath constrained the sea to be of service that ye eat fresh meat from thence, and bring forth from thence ornaments which ye wear. And thou seest the ships ploughing it that ye (mankind) may seek of His bounty and that haply ye may give thanks.

source: وألقى في الأرض رواسي أن تميد بكم وأنهارا وسبلا لعلكم تهتدون
en: And He hath cast into the earth firm hills that it quake not with you, and streams and roads that ye may find a way.

source: وعلامات وبالنجم هم يهتدون
en: And landmarks (too), and by the star they find a way.

source: أفمن يخلق كمن لا يخلق أفلا تذكرون
en: Is He then Who createth as him who createth not? Will ye not then remember?

source: وإن تعدوا نعمة الله لا تحصوها إن الله لغفور رحيم
en: And if ye would count the favour of Allah ye cannot reckon it. Lo! Allah is indeed Forgiving, Merciful.

source: والله يعلم ما تسرون وما تعلنون
en: And Allah knoweth that which ye keep hidden and that which ye proclaim.

source: والذين يدعون من دون الله لا يخلقون شيئا وهم يخلقون
en: Those unto whom they cry beside Allah created naught, but are themselves created.

source: أموات غير أحياء وما يشعرون أيان يبعثون
en: (They are) dead, not living. And they know not when they will be raised.

source: إلهكم إله واحد فالذين لا يؤمنون بالآخرة قلوبهم منكرة وهم مستكبرون
en: Your Allah is One Allah. But as for those who believe not in the Hereafter their hearts refuse to know, for they are proud.

source: لا جرم أن الله يعلم ما يسرون وما يعلنون إنه لا يحب المستكبرين
en: Assuredly Allah knoweth that which they keep hidden and that which they proclaim. Lo! He loveth not the proud.

source: وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين
en: And when it is said unto them: What hath your Lord revealed? they say: (Mere) fables of the men of old,

source: ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم ألا ساء ما يزرون
en: That they may bear their burdens undiminished on the Day of Resurrection, with somewhat of the burdens of those whom they mislead without knowledge. Ah! evil is that which they bear!

source: قد مكر الذين من قبلهم فأتى الله بنيانهم من القواعد فخر عليهم السقف من فوقهم وأتاهم العذاب من حيث لا يشعرون
en: Those before them plotted, so Allah struck at the foundations of their building, and then the roof fell down upon them from above them, and the doom came on them whence they knew not;

source: ثم يوم القيامة يخزيهم ويقول أين شركائي الذين كنتم تشاقون فيهم قال الذين أوتوا العلم إن الخزي اليوم والسوء على الكافرين
en: Then on the Day of Resurrection He will disgrace them and will say: Where are My partners, for whose sake ye opposed (My guidance)? Those who have been given knowledge will say: Disgrace this day and evil are upon the disbelievers,

source: الذين تتوفاهم الملائكة ظالمي أنفسهم فألقوا السلم ما كنا نعمل من سوء بلى إن الله عليم بما كنتم تعملون
en: Whom the angels cause to die while they are wronging themselves. Then will they make full submission (saying): We used not to do any wrong. Nay! Surely Allah is Knower of what ye used to do.

source: فادخلوا أبواب جهنم خالدين فيها فلبئس مثوى المتكبرين
en: So enter the gates of hell, to dwell therein for ever. Woeful indeed will be the lodging of the arrogant.

source: وقيل للذين اتقوا ماذا أنزل ربكم قالوا خيرا للذين أحسنوا في هذه الدنيا حسنة ولدار الآخرة خير ولنعم دار المتقين
en: And it is said unto those who ward off (evil): What hath your Lord revealed? They say: Good. For those who do good in this world there is a good (reward) and the home of the Hereafter will be better. Pleasant indeed will be the home of those who ward off (evil) -

source: جنات عدن يدخلونها تجري من تحتها الأنهار لهم فيها ما يشاءون كذلك يجزي الله المتقين
en: Gardens of Eden which they enter, underneath which rivers flow, wherein they have what they will. Thus Allah repayeth those who ward off (evil),

source: الذين تتوفاهم الملائكة طيبين يقولون سلام عليكم ادخلوا الجنة بما كنتم تعملون
en: Those whom the angels cause to die (when they are) good. They say: Peace be unto you! Enter the Garden because of what ye used to do.

source: هل ينظرون إلا أن تأتيهم الملائكة أو يأتي أمر ربك كذلك فعل الذين من قبلهم وما ظلمهم الله ولكن كانوا أنفسهم يظلمون
en: Await they aught say that the angels should come unto them or thy Lord's command should come to pass? Even so did those before them. Allah wronged them not, but they did wrong themselves,

source: فأصابهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: So that the evils of what they did smote them, and that which they used to mock surrounded them.

source: وقال الذين أشركوا لو شاء الله ما عبدنا من دونه من شيء نحن ولا آباؤنا ولا حرمنا من دونه من شيء كذلك فعل الذين من قبلهم فهل على الرسل إلا البلاغ المبين
en: And the idolaters say: Had Allah willed, we had not worshipped aught beside Him, we and our fathers, nor had we forbidden aught without (command from) Him. Even so did those before them. Are the messengers charged with aught save plain conveyance (of the message)?

source: ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حقت عليه الضلالة فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين
en: And verily We have raised in every nation a messenger, (proclaiming): Serve Allah and shun false gods. Then some of them (there were) whom Allah guided, and some of them (there were) upon whom error had just hold. Do but travel in the land and see the nature of the consequence for the deniers!

source: إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين
en: Even if thou (O Muhammad) desirest their right guidance, still Allah assuredly will not guide him who misleadeth. Such have no helpers.

source: وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت بلى وعدا عليه حقا ولكن أكثر الناس لا يعلمون
en: And they swear by Allah their most binding oaths (that) Allah will not raise up him who dieth. Nay, but it is a promise (binding) upon Him in truth, but most of mankind know not,

source: ليبين لهم الذي يختلفون فيه وليعلم الذين كفروا أنهم كانوا كاذبين
en: That He may explain unto them that wherein they differ, and that those who disbelieved may know that they were liars.

source: إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون
en: And Our word unto a thing, when We intend it, is only that We say unto it: Be! and it is.

source: والذين هاجروا في الله من بعد ما ظلموا لنبوئنهم في الدنيا حسنة ولأجر الآخرة أكبر لو كانوا يعلمون
en: And those who became fugitives for the cause of Allah after they had been oppressed, We verily shall give them goodly lodging in the world, and surely the reward of the Hereafter is greater, if they but knew;

source: الذين صبروا وعلى ربهم يتوكلون
en: Such as are steadfast and put their trust in Allah.

source: وما أرسلنا من قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: And We sent not (as Our messengers) before thee other than men whom We inspired - Ask the followers of the Remembrance if ye know not! -

source: بالبينات والزبر وأنزلنا إليك الذكر لتبين للناس ما نزل إليهم ولعلهم يتفكرون
en: With clear proofs and writings; and We have revealed unto thee the Remembrance that thou mayst explain to mankind that which hath been revealed for them, and that haply they may reflect.

source: أفأمن الذين مكروا السيئات أن يخسف الله بهم الأرض أو يأتيهم العذاب من حيث لا يشعرون
en: Are they who plan ill-deeds then secure that Allah will not cause the earth to swallow them, or that the doom will not come on them whence they know not?

source: أو يأخذهم في تقلبهم فما هم بمعجزين
en: Or that He will not seize them in their going to and fro so that there be no escape for them?

source: أو يأخذهم على تخوف فإن ربكم لرءوف رحيم
en: Or that He will not seize them with a gradual wasting? Lo! thy Lord is indeed Full of Pity, Merciful.

source: أولم يروا إلى ما خلق الله من شيء يتفيأ ظلاله عن اليمين والشمائل سجدا لله وهم داخرون
en: Have they not observed all things that Allah hath created, how their shadows incline to the right and to the left, making prostration unto Allah, and they are lowly?

source: ولله يسجد ما في السماوات وما في الأرض من دابة والملائكة وهم لا يستكبرون
en: And unto Allah maketh prostration whatsoever is in the heavens and whatsoever is in the earth of living creatures, and the angels (also) and they are not proud.

source: يخافون ربهم من فوقهم ويفعلون ما يؤمرون
en: They fear their Lord above them, and do what they are bidden.

source: وقال الله لا تتخذوا إلهين اثنين إنما هو إله واحد فإياي فارهبون
en: Allah hath said: Choose not two gods. There is only One Allah. So of Me, Me only, be in awe.

source: وله ما في السماوات والأرض وله الدين واصبا أفغير الله تتقون
en: Unto Him belongeth whatsoever is in the heavens and the earth, and religion is His for ever. Will ye then fear any other than Allah?

source: وما بكم من نعمة فمن الله ثم إذا مسكم الضر فإليه تجأرون
en: And whatever of comfort ye enjoy, it is from Allah. Then, when misfortune reacheth you, unto Him ye cry for help.

source: ثم إذا كشف الضر عنكم إذا فريق منكم بربهم يشركون
en: And afterward, when He hath rid you of the misfortune, behold! a set of you attribute partners to their Lord,

source: ليكفروا بما آتيناهم فتمتعوا فسوف تعلمون
en: So as to deny that which We have given them. Then enjoy life (while ye may), for ye will come to know.

source: ويجعلون لما لا يعلمون نصيبا مما رزقناهم تالله لتسألن عما كنتم تفترون
en: And they assign a portion of that which We have given them unto what they know not. By Allah! but ye will indeed be asked concerning (all) that ye used to invent.

source: ويجعلون لله البنات سبحانه ولهم ما يشتهون
en: And they assign unto Allah daughters - Be He Glorified! - and unto themselves what they desire;

source: وإذا بشر أحدهم بالأنثى ظل وجهه مسودا وهو كظيم
en: When if one of them receiveth tidings of the birth of a female, his face remaineth darkened, and he is wroth inwardly.

source: يتوارى من القوم من سوء ما بشر به أيمسكه على هون أم يدسه في التراب ألا ساء ما يحكمون
en: He hideth himself from the folk because of the evil of that whereof he hath had tidings, (asking himself): Shall he keep it in contempt, or bury it beneath the dust. Verily evil is their judgment.

source: للذين لا يؤمنون بالآخرة مثل السوء ولله المثل الأعلى وهو العزيز الحكيم
en: For those who believe not in the Hereafter is an evil similitude, and Allah's is the Sublime Similitude. He is the Mighty, the Wise.

source: ولو يؤاخذ الله الناس بظلمهم ما ترك عليها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم لا يستأخرون ساعة ولا يستقدمون
en: If Allah were to take mankind to task for their wrong-doing, he would not leave hereon a living creature, but He reprieveth them to an appointed term, and when their term cometh they cannot put (it) off an hour nor (yet) advance (it).

source: ويجعلون لله ما يكرهون وتصف ألسنتهم الكذب أن لهم الحسنى لا جرم أن لهم النار وأنهم مفرطون
en: And they assign unto Allah that which they (themselves) dislike, and their tongues expound the lie that the better portion will be theirs. Assuredly theirs will be the Fire, and they will be abandoned.

source: تالله لقد أرسلنا إلى أمم من قبلك فزين لهم الشيطان أعمالهم فهو وليهم اليوم ولهم عذاب أليم
en: By Allah, We verily sent messengers unto the nations before thee, but the devil made their deeds fairseeming unto them. So he is their patron this day, and theirs will be a painful doom.

source: وما أنزلنا عليك الكتاب إلا لتبين لهم الذي اختلفوا فيه وهدى ورحمة لقوم يؤمنون
en: And We have revealed the Scripture unto thee only that thou mayst explain unto them that wherein they differ, and (as) a guidance and a mercy for a people who believe.

source: والله أنزل من السماء ماء فأحيا به الأرض بعد موتها إن في ذلك لآية لقوم يسمعون
en: Allah sendeth down water from the sky and therewith reviveth the earth after her death. Lo! herein is indeed a portent for a folk who hear.

source: وإن لكم في الأنعام لعبرة نسقيكم مما في بطونه من بين فرث ودم لبنا خالصا سائغا للشاربين
en: And lo! in the cattle there is a lesson for you. We give you to drink of that which is in their bellies, from betwixt the refuse and the blood, pure milk palatable to the drinkers.

source: ومن ثمرات النخيل والأعناب تتخذون منه سكرا ورزقا حسنا إن في ذلك لآية لقوم يعقلون
en: And of the fruits of the date-palm, and grapes, whence ye derive strong drink and (also) good nourishment. Lo! therein is indeed a portent for people who have sense.

source: وأوحى ربك إلى النحل أن اتخذي من الجبال بيوتا ومن الشجر ومما يعرشون
en: And thy Lord inspired the bee, saying: Choose thou habitations in the hills and in the trees and in that which they thatch;

source: ثم كلي من كل الثمرات فاسلكي سبل ربك ذللا يخرج من بطونها شراب مختلف ألوانه فيه شفاء للناس إن في ذلك لآية لقوم يتفكرون
en: Then eat of all fruits, and follow the ways of thy Lord, made smooth (for thee). There cometh forth from their bellies a drink divers of hues, wherein is healing for mankind. Lo! herein is indeed a portent for people who reflect.

source: والله خلقكم ثم يتوفاكم ومنكم من يرد إلى أرذل العمر لكي لا يعلم بعد علم شيئا إن الله عليم قدير
en: And Allah createth you, then causeth you to die, and among you is he who is brought back to the most abject stage of life, so that he knoweth nothing after (having had) knowledge. Lo! Allah is Knower, Powerful.

source: والله فضل بعضكم على بعض في الرزق فما الذين فضلوا برادي رزقهم على ما ملكت أيمانهم فهم فيه سواء أفبنعمة الله يجحدون
en: And Allah hath favoured some of you above others in provision. Now those who are more favoured will by no means hand over their provision to those (slaves) whom their right hands possess, so that they may be equal with them in respect thereof. Is it then the grace of Allah that they deny?

source: والله جعل لكم من أنفسكم أزواجا وجعل لكم من أزواجكم بنين وحفدة ورزقكم من الطيبات أفبالباطل يؤمنون وبنعمت الله هم يكفرون
en: And Allah hath given you wives of your own kind, and hath given you, from your wives, sons and grandsons, and hath made provision of good things for you. Is it then in vanity that they believe and in the grace of Allah that they disbelieve?

source: ويعبدون من دون الله ما لا يملك لهم رزقا من السماوات والأرض شيئا ولا يستطيعون
en: And they worship beside Allah that which owneth no provision whatsoever for them from the heavens or the earth, nor have they (whom they worship) any power.

source: فلا تضربوا لله الأمثال إن الله يعلم وأنتم لا تعلمون
en: So coin not similitudes for Allah. Lo! Allah knoweth; ye know not.

source: ضرب الله مثلا عبدا مملوكا لا يقدر على شيء ومن رزقناه منا رزقا حسنا فهو ينفق منه سرا وجهرا هل يستوون الحمد لله بل أكثرهم لا يعلمون
en: Allah coineth a similitude: (on the one hand) a (mere) chattel slave, who hath control of nothing, and (on the other hand) one on whom we have bestowed a fair provision from Us, and he spendeth thereof secretly and openly. Are they equal? Praise be to Allah! But most of them know not.

source: وضرب الله مثلا رجلين أحدهما أبكم لا يقدر على شيء وهو كل على مولاه أينما يوجهه لا يأت بخير هل يستوي هو ومن يأمر بالعدل وهو على صراط مستقيم
en: And Allah coineth a similitude: Two men, one of them dumb, having control of nothing, and he is a burden on his owner; whithersoever he directeth him to go, he bringeth no good. Is he equal with one who enjoineth justice and followeth a straight path (of conduct)?

source: ولله غيب السماوات والأرض وما أمر الساعة إلا كلمح البصر أو هو أقرب إن الله على كل شيء قدير
en: And unto Allah belongeth the Unseen of the heavens and the earth, and the matter of the Hour (of Doom) is but as a twinkling of the eye, or it is nearer still. Lo! Allah is Able to do all things.

source: والله أخرجكم من بطون أمهاتكم لا تعلمون شيئا وجعل لكم السمع والأبصار والأفئدة لعلكم تشكرون
en: And Allah brought you forth from the wombs of your mothers knowing nothing, and gave you hearing and sight and hearts that haply ye might give thanks.

source: ألم يروا إلى الطير مسخرات في جو السماء ما يمسكهن إلا الله إن في ذلك لآيات لقوم يؤمنون
en: Have they not seen the birds obedient in mid-air? None holdeth them save Allah. Lo! herein, verily, are portents for a people who believe.

source: والله جعل لكم من بيوتكم سكنا وجعل لكم من جلود الأنعام بيوتا تستخفونها يوم ظعنكم ويوم إقامتكم ومن أصوافها وأوبارها وأشعارها أثاثا ومتاعا إلى حين
en: And Allah hath given you in your houses an abode, and hath given you (also), of the hides of cattle, houses which ye find light (to carry) on the day of migration and on the day of pitching camp; and of their wool and their fur and their hair, caparison and comfort for a while.

source: والله جعل لكم مما خلق ظلالا وجعل لكم من الجبال أكنانا وجعل لكم سرابيل تقيكم الحر وسرابيل تقيكم بأسكم كذلك يتم نعمته عليكم لعلكم تسلمون
en: And Allah hath given you, of that which He hath created, shelter from the sun; and hath given you places of refuge in the mountains, and hath given you coats to ward off the heat from you, and coats (of armour) to save you from your own foolhardiness. Thus doth He perfect His favour unto you, in order that ye may surrender (unto Him).

source: فإن تولوا فإنما عليك البلاغ المبين
en: Then, if they turn away, thy duty (O Muhammad) is but plain conveyance (of the message).

source: يعرفون نعمت الله ثم ينكرونها وأكثرهم الكافرون
en: They know the favour of Allah and then deny it. Most of them are ingrates.

source: ويوم نبعث من كل أمة شهيدا ثم لا يؤذن للذين كفروا ولا هم يستعتبون
en: And (bethink you of) the day when we raise up of every nation a witness, then there is no leave for disbelievers, nor are they allowed to make amends.

source: وإذا رأى الذين ظلموا العذاب فلا يخفف عنهم ولا هم ينظرون
en: And when those who did wrong behold the doom, it will not be made light for them, nor will they be reprieved.

source: وإذا رأى الذين أشركوا شركاءهم قالوا ربنا هؤلاء شركاؤنا الذين كنا ندعو من دونك فألقوا إليهم القول إنكم لكاذبون
en: And when those who ascribed partners to Allah behold those partners of theirs, they will say: Our Lord! these are our partners unto whom we used to cry instead of Thee. But they will fling to them the saying: Lo! ye verily are liars!

source: وألقوا إلى الله يومئذ السلم وضل عنهم ما كانوا يفترون
en: And they proffer unto Allah submission on that day, and all that they used to invent hath failed them.

source: الذين كفروا وصدوا عن سبيل الله زدناهم عذابا فوق العذاب بما كانوا يفسدون
en: For those who disbelieve and debar (men) from the way of Allah, We add doom to doom because they wrought corruption,

source: ويوم نبعث في كل أمة شهيدا عليهم من أنفسهم وجئنا بك شهيدا على هؤلاء ونزلنا عليك الكتاب تبيانا لكل شيء وهدى ورحمة وبشرى للمسلمين
en: And (bethink you of) the day when We raise in every nation a witness against them of their own folk, and We bring thee (Muhammad) as a witness against these. And We reveal the Scripture unto thee as an exposition of all things, and a guidance and a mercy and good tidings for those who have surrendered (to Allah).

source: إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى وينهى عن الفحشاء والمنكر والبغي يعظكم لعلكم تذكرون
en: Lo! Allah enjoineth justice and kindness, and giving to kinsfolk, and forbiddeth lewdness and abomination and wickedness. He exhorteth you in order that ye may take heed.

source: وأوفوا بعهد الله إذا عاهدتم ولا تنقضوا الأيمان بعد توكيدها وقد جعلتم الله عليكم كفيلا إن الله يعلم ما تفعلون
en: Fulfil the covenant of Allah when ye have covenanted, and break not your oaths after the asseveration of them, and after ye have made Allah surety over you. Lo! Allah knoweth what ye do.

source: ولا تكونوا كالتي نقضت غزلها من بعد قوة أنكاثا تتخذون أيمانكم دخلا بينكم أن تكون أمة هي أربى من أمة إنما يبلوكم الله به وليبينن لكم يوم القيامة ما كنتم فيه تختلفون
en: And be not like unto her who unravelleth the thread, after she hath made it strong, to thin filaments, making your oaths a deceit between you because of a nation being more numerous than (another) nation. Allah only trieth you thereby, and He verily will explain to you on the Day of Resurrection that wherein ye differed.

source: ولو شاء الله لجعلكم أمة واحدة ولكن يضل من يشاء ويهدي من يشاء ولتسألن عما كنتم تعملون
en: Had Allah willed He could have made you (all) one nation, but He sendeth whom He will astray and guideth whom He will, and ye will indeed be asked of what ye used to do.

source: ولا تتخذوا أيمانكم دخلا بينكم فتزل قدم بعد ثبوتها وتذوقوا السوء بما صددتم عن سبيل الله ولكم عذاب عظيم
en: Make not your oaths a deceit between you, lest a foot should slip after being firmly planted and ye should taste evil forasmuch as ye debarred (men) from the way of Allah, and yours should be an awful doom.
